<template>
  <div class="about">
    <h2> About this site </h2>
    <br>
    <p>ランダムなくじにちょっとあみだくじ要素を追加したものです</p>
    <p>ルール: </p>
    <p>参加者の人数、名前と当選人数を入力して、ゲームを開始します。</p>
    <p>ゲームはあみだくじですが、あみだくじの上下はランダムになっていて全員が線を引くまでは完全に隠されています</p>
    <p>線を引くことは１人０〜３回まで可能です。引き終わって次の人にターンを回す時は「操作を終える」ボタンを押しましょう。</p>
    <p>全員が線を引き終えたら、「抽選をはじめる！」というボタンが現れるので、これを押すとアニメーションが始まります</p>
    <p>アニメーションが終わったら、「結果表示」ボタンが現れるので、最終的な結果を知ることができます</p>
    <br>
    <h3>Hashの算出について: </h3>
    <p>Hashは、あみだくじの上段の文字列(参加者の名前)をその順で並べたもの下段の文字列(当選か落選か)をその順で並べたもの、ランダムな文字列(salt, 事前に公開)をならべたものを、SHA-256に入れて計算しています。</p>
    <div style="text-align: center; margin: 40px 0">
      <router-link to="/" style="font-size:14px">タイトルに戻る</router-link>
    </div>
  </div>
</template>

<style>
@media (min-width: 1024px) {
  .about {
    min-height: 100vh;
    align-items: center;
  }
}
</style>
